Revit 2026 API

# StoneStoneColor Property

---

The property labeled "Image" from the "Stone" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string StoneColor { get; }
```
```vb
Public Shared ReadOnly Property StoneColor As String
	Get
```
```cpp
public:
static property String^ StoneColor {
	String^ get ();
}
```
```fsharp
static member StoneColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Stone Class

Autodesk.Revit.DB.Visual Namespace